<a href="https://colab.research.google.com/github/mohanrajofficial87/Data_Preparation_Python/blob/master/Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas Basics

In [0]:
#Reading Iris Dataset
import pandas as pd #Python Data Analysis Library 
import numpy as np #Python Scientific Library 

#Link to get the Iris Dataset
url = "http://bit.ly/kaggletrain"
#Defining Column names
col_names = ['PassengerId','Survived','Pclass','Name','Sex','Age','SibSp','Parch','Ticket','Fare','Cabin','Embarked']
#Reading the dataset using url
dataset = pd.read_csv(url, names=col_names, skiprows=1, delimiter=',')

Getting information on the dataset

In [20]:
#Way of storing data
type(dataset)

pandas.core.frame.DataFrame

In [21]:
#Getting first 5 rows of the dataset
dataset.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [22]:
#Basic info on the dataset (Column & Type)
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [23]:
#Getting summary statistics about the numberic columns in the data
dataset.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

Methods of Slicing the dataset

In [24]:
#Indexing

#Selecting 4nd row (In python number index starts from 0)
#iloc - Integer location
dataset.iloc[3]

PassengerId                                               4
Survived                                                  1
Pclass                                                    1
Name           Futrelle, Mrs. Jacques Heath (Lily May Peel)
Sex                                                  female
Age                                                      35
SibSp                                                     1
Parch                                                     0
Ticket                                               113803
Fare                                                   53.1
Cabin                                                  C123
Embarked                                                  S
Name: 3, dtype: object

In [26]:
#Using loc
dataset.loc[0:4, ['Name', 'Pclass']]

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

Slicing with condition

In [28]:
#Using column names
dataset[dataset['Pclass'] > 2]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
2              3         1       3  ...   7.9250   NaN         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
7              8         0       3  ...  21.0750   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
882          883         0       3  ...  10.5167   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
888          889         0       3  ...  23.4500   NaN         S
890          891         0       3  ...   7.7500   NaN         Q

[491 rows x 12 columns]

In [29]:
#Using query
dataset.query('Pclass < 2')

     PassengerId  Survived  Pclass  ...     Fare        Cabin  Embarked
1              2         1       1  ...  71.2833          C85         C
3              4         1       1  ...  53.1000         C123         S
6              7         0       1  ...  51.8625          E46         S
11            12         1       1  ...  26.5500         C103         S
23            24         1       1  ...  35.5000           A6         S
..           ...       ...     ...  ...      ...          ...       ...
871          872         1       1  ...  52.5542          D35         S
872          873         0       1  ...   5.0000  B51 B53 B55         S
879          880         1       1  ...  83.1583          C50         C
887          888         1       1  ...  30.0000          B42         S
889          890         1       1  ...  30.0000         C148         C

[216 rows x 12 columns]

In [32]:
#Multiple Condition
dataset[(dataset.Pclass < 2) & (dataset.Age > 70)]

#Same as
# dataset[(dataset['Pclass'] < 2) & (dataset['Age'] > 70)]
# dataset.query('(Pclass < 2) & (Age > 70)']

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
96            97         0       1  ...  34.6542    A5         C
493          494         0       1  ...  49.5042   NaN         C
630          631         1       1  ...  30.0000   A23         S

[3 rows x 12 columns]

In [34]:
#Getting unique values from the column
dataset.Pclass.unique()

array([3, 1, 2])

In [35]:
#Sorting the dataset
dataset.sort_values('Age', ascending=False).head()

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
630          631         1       1  ...  30.0000   A23         S
851          852         0       3  ...   7.7750   NaN         S
493          494         0       1  ...  49.5042   NaN         C
96            97         0       1  ...  34.6542    A5         C
116          117         0       3  ...   7.7500   NaN         Q

[5 rows x 12 columns]

Aggregation

In [36]:
#Counting the frequency of values in a column
dataset['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [37]:
#Groupby
dataset.groupby(['Pclass', 'Survived'])['PassengerId'].count()

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: PassengerId, dtype: int64

In [38]:
#Pivot Table
dataset.pivot_table(index='Pclass',
                    columns='Survived',
                    values='PassengerId',
                    aggfunc='count')

Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

Jump into correlation

In [40]:
corr_with_Survived = dataset.corr()['Survived'].sort_values()
corr_with_Survived

Pclass        -0.338481
Age           -0.077221
SibSp         -0.035322
PassengerId   -0.005007
Parch          0.081629
Fare           0.257307
Survived       1.000000
Name: Survived, dtype: float64